Reports/Лео_АвтоматическиеСкидки/Лео_АвтоматическиеСкидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Лео_АвтоматическиеСкидки</name>
</mdclass:Report>

InformationRegisters/абс_СкидкиНаценки/абс_СкидкиНаценки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СкидкиНаценки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПроцентСкидкиНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОграничениеСкидкиНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкидкаСуммой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкидкаКоличеством</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УсловиеДляСкидкиКоличеством</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименятьСкидкуДоОграничения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаНакопления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Лимит_Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Условие</name>
    <type>
      <types>EnumRef.УсловияСкидкиНаценки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначаетсяВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Reports/Лео_АвтоматическиеСкидки/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка = Ложь;

	//ДатаНач = дата(1,1,1);
	//ДатаКон = дата(1,1,1);
	
	Реализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	
	ТЗ = ПолучитьТЗ(КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение,
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1].Значение);
	
	
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки = КомпоновщикНастроек.Настройки;
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//// установка периода
	//Настройки.ПараметрыДанных.Элементы[2].Значение = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение;
	//
	//// установка параметра подразделение
	//СпЗначений = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Значение;
	//Если ТипЗнч(СпЗначений) = Тип("СправочникСсылка.СтруктураПредприятия") тогда
	//	Настройки.ПараметрыДанных.Элементы[3].Значение = Справочники.СтруктураПредприятия.ПустаяСсылка();
	//	Настройки.ПараметрыДанных.Элементы[3].Значение = СпЗначений; 	
	//иначе
	//	Настройки.ПараметрыДанных.Элементы[3].Значение.Очистить();
	//	Для сс = 0 по СпЗначений.Количество() - 1 цикл
	//		Настройки.ПараметрыДанных.Элементы[3].Значение.Добавить(СпЗначений[сс].значение);
	//	Конеццикла;
	//КонецЕсли;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	ВнешнийНаборДанных = Новый Структура("ТЗ", ТЗ);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);    	

КонецПроцедуры


функция ПолучитьВсеСкидкиПоДокументу(Заказ,Ном, Конт) 
	
	
	ДатаПоДаннымПокупателя = Заказ.Дата;
	ТЗ_СкидкиЗаказа = Заказ.абс_СкидкиНаценки.ВыгрузитьКолонку("Скидка");

	
	ДокументСкидки = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	абс_СкидкиНаценкиСрезПоследних.Регистратор КАК ДокументСкидки,
	|	абс_СкидкиНаценкиСрезПоследних.Лимит_Количество
	|ИЗ
	|	РегистрСведений.абс_СкидкиНаценки.СрезПоследних(
	|			&ДатаДок,
	|			Номенклатура = &Ном
	|				И Контрагент = &Конт) КАК абс_СкидкиНаценкиСрезПоследних
	|ГДЕ
	|	(абс_СкидкиНаценкиСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ абс_СкидкиНаценкиСрезПоследних.ДатаОкончания >= &ДатаДок)
	|	И абс_СкидкиНаценкиСрезПоследних.Регистратор В(&ТаблицаСкидок)";
	
	Запрос.УстановитьПараметр("Ном",Ном);
	Запрос.УстановитьПараметр("Конт",Конт);
	Запрос.УстановитьПараметр("ДатаДок",ДатаПоДаннымПокупателя);
	Запрос.УстановитьПараметр("ТаблицаСкидок",ТЗ_СкидкиЗаказа);

	Рез = Запрос.Выполнить();
	Если Не Рез.Пустой() тогда
		  Выборка = Рез.Выбрать();
	      Выборка.Следующий();
	      ДокументСкидки = Выборка.ДокументСкидки;
		  Лимит_Количество = Выборка.Лимит_Количество;
		  Возврат Новый Структура("ДокументСкидки, Лимит_Количество", ДокументСкидки, Лимит_Количество);

	Иначе
		Возврат неопределено;
	КонецЕсли;

	
//	Возврат ДокументСкидки;
	
КонецФункции	


функция ПолучитьТЗ(ДатаНач,ДатаКон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Ссылка,
		|	ЗаказПокупателяТовары.Номенклатура,
		|	СУММА(ЗаказПокупателяТовары.абс_СуммаАвтоматическойСкидки) КАК абс_СуммаАвтоматическойСкидки,
		|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ТЗ_Заказ
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|	И ЗаказПокупателяТовары.абс_СуммаАвтоматическойСкидки > 0
		|	И ЗаказПокупателяТовары.Ссылка.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяТовары.Ссылка,
		|	ЗаказПокупателяТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ_Заказ.Ссылка КАК Заказ,
		|	ТЗ_Заказ.Номенклатура КАК НоменклатураЗаказ,
		|	ТЗ_Заказ.абс_СуммаАвтоматическойСкидки,
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.Количество,
		|	ВложенныйЗапрос.Сумма,
		|	ТЗ_Заказ.Ссылка.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ТЗ_Заказ.Ссылка.Контрагент КАК Контрагент,
		|	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
		|	ВложенныйЗапрос.ЕдиницаИзмерения,
		|	ВложенныйЗапрос.Ссылка.Номер КАК НомерТоварнойНакладной,
		|	ВложенныйЗапрос.Ссылка КАК Реализация,
		|	ТЗ_Заказ.Количество КАК КоличествоЗаказ
		|ИЗ
		|	ТЗ_Заказ КАК ТЗ_Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
		|			РеализацияТоваровУслугТовары.Ссылка.Сделка КАК Сделка,
		|			РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|			СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
		|			СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма,
		|			РеализацияТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|		ИЗ
		|			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ГДЕ
		|			РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
		|		
		|		СГРУППИРОВАТЬ ПО
		|			РеализацияТоваровУслугТовары.Ссылка,
		|			РеализацияТоваровУслугТовары.Ссылка.Сделка,
		|			РеализацияТоваровУслугТовары.Номенклатура,
		|			РеализацияТоваровУслугТовары.ЕдиницаИзмерения) КАК ВложенныйЗапрос
		|		ПО ТЗ_Заказ.Ссылка = ВложенныйЗапрос.Сделка
		|			И ТЗ_Заказ.Номенклатура = ВложенныйЗапрос.Номенклатура";

	Запрос.УстановитьПараметр("Дата1", НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаКон)); 


	Результат = Запрос.Выполнить();

	ТЗ = Результат.Выгрузить();
	
	 // Скидки
	ТЗ.Колонки.Добавить("УстановкаСкидок");
	ТЗ.Колонки.Добавить("ТипСкидкиНаценки");
	ТЗ.Колонки.Добавить("ПроцентСкидкиНаценки");
	ТЗ.Колонки.Добавить("Лео_НомерАктивности");
	ТЗ.Колонки.Добавить("СуммаСкидкиСНДС");
	ТЗ.Колонки.Добавить("СуммаСкидкиБезНДС");
	ТЗ.Колонки.Добавить("Лимит_Количество");
   ///////////////////////////////////////////////////////////////////////////////////////////////////////
   
   Для Каждого стр из ТЗ цикл
	   СкидкиПоДокументу = ПолучитьВсеСкидкиПоДокументу(стр.Заказ, стр.Номенклатура, стр.Контрагент);
	   Если  СкидкиПоДокументу <> Неопределено Тогда
		   _Док = СкидкиПоДокументу.ДокументСкидки;
		   
		   Стр.УстановкаСкидок      = _Док;
		   Стр.ТипСкидкиНаценки     = _Док.ТипСкидкиНаценки;
		   Стр.ПроцентСкидкиНаценки = _Док.ПроцентСкидкиНаценки;
		   Стр.Лео_НомерАктивности  = _Док.Лео_НомерАктивности;
		   Стр.Лимит_Количество     =  СкидкиПоДокументу.Лимит_Количество;
		   ЗначениеСтавкиНДС 	      = УчетНДС.ПолучитьСтавкуНДС(стр.Номенклатура.СтавкаНДС);
		   
		   Если Стр.Заказ.СуммаВключаетНДС Тогда
			   Стр.СуммаСкидкиСНДС = Стр.Количество * стр.абс_СуммаАвтоматическойСкидки/стр.КоличествоЗаказ;
			   Стр.СуммаСкидкиБезНДС =   Стр.Количество * (стр.абс_СуммаАвтоматическойСкидки/(1 + ЗначениеСтавкиНДС/100))/стр.КоличествоЗаказ;
		   Иначе
			   Стр.СуммаСкидкиСНДС =   Стр.Количество * (стр.абс_СуммаАвтоматическойСкидки * (100 + ЗначениеСтавкиНДС) / 100)/стр.КоличествоЗаказ;
			   Стр.СуммаСкидкиБезНДС = Стр.Количество * стр.абс_СуммаАвтоматическойСкидки/стр.КоличествоЗаказ;
		   КонецЕсли;
		   
	   КонецЕсли;	
	   
   КонецЦикла;
   возврат ТЗ;
	
КонецФункции
